# Feb 23 Pandas Basic Assignement

## Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
import pandas as pd
sr = pd.Series((4, 8, 15, 16, 23, 42))
print(sr.to_string())

0     4
1     8
2    15
3    16
4    23
5    42

## Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [5]:
ls = [3,4,5,6,7,8,12,34,54,67]

In [7]:
sr2 = pd.Series(ls)

In [8]:
print(sr2)

0     3
1     4
2     5
3     6
4     7
5     8
6    12
7    34
8    54
9    67
dtype: int64

## Q3. Create a Pandas DataFrame that contains the following data:Then, print the DataFrame.

In [10]:
data = {"Name":["Alice","Bob","Claire"],
        "Age" : [25,30,27],
        "Gender" :["Female","Male","Female"]
       }

In [11]:
df = pd.DataFrame(data)

In [12]:
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

## Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

### A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns. Where as 
### A Pandas Series is like a column in a table.It is a one-dimensional array holding data of any type.

In [13]:
## Example
data = {"Name":["Alice","Bob","Claire"],
        "Age" : [25,30,27],
        "Gender" :["Female","Male","Female"]
       }
df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [14]:
type(df)

pandas.core.frame.DataFrame

In [15]:
df["Name"]

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [16]:
type(df["Name"])

pandas.core.series.Series

## Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

### Some common functions to manipulte data in pandas are
1) fillna()
2) dropna()
3) sum()
4) replace()
5) append()

In [5]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [8]:
df.dropna() # drops the rows having any empty cell and returns a new dataframe

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

## Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

### DataFrame is mutable in nature.
### All pandas data structures are value-mutable (the values they contain can be altered) but not always size-mutable. The length of a Series cannot be changed, but, for example, columns can be inserted into a DataFrame. However, the vast majority of methods produce new objects and leave the input data untouched.

## Q7. Create a DataFrame using multiple Series. Explain with an example.

### We can create DataFrame using multiple Series by combining them into a dictionary .For example

In [17]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
df.dropna(inplace=True)

In [18]:
nameSeries = df['Name']
sexSeries = df['Sex']
ageSeries = df['Age']
type(nameSeries)

pandas.core.series.Series

In [19]:
myDict = {"name":nameSeries,"sex":sexSeries,"age":ageSeries}

In [20]:
newDf = pd.DataFrame(myDict)

In [21]:
type(newDf)

pandas.core.frame.DataFrame

In [22]:
newDf

                                                  name     sex   age
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
6                              McCarthy, Mr. Timothy J    male  54.0
10                     Sandstrom, Miss. Marguerite Rut  female   4.0
11                            Bonnell, Miss. Elizabeth  female  58.0
..                                                 ...     ...   ...
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0
872                           Carlsson, Mr. Frans Olof    male  33.0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0
887                       Graham, Miss. Margaret Edith  female  19.0
889                              Behr, Mr. Karl Howell    male  26.0

[183 rows x 3 columns]